xtee55/mediator-common-test/src/main/resources/v5xroad-simple5.request

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:id="http://x-road.eu/xsd/identifiers" 
    xmlns:xroad="http://x-road.eu/xsd/xroad.xsd" 
    xmlns:xrd="http://x-road.ee/xsd/x-road.xsd" 
    xmlns:xml="http://www.w3.org/XML/1998/namespace">
    <SOAP-ENV:Header>
        <xrd:consumer>consumer</xrd:consumer>
        <xrd:producer>producer</xrd:producer>
        <xrd:userId>EE37702211234</xrd:userId>
        <xrd:id>1234567890</xrd:id>
        <xrd:service>producer.testQuery.v1</xrd:service>
        <xrd:issue/>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns4:testQuery xmlns:ns4="http://xts4client.ee.x-road.ee/producer/">
            <request>
                <seed>100</seed>
            </request>
        </ns4:testQuery>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
